// © Copyright 2011-2013, 2015-2016 HP Development Company, L.P.

TaskName = "User Roles Management";

UsersTabTitle = "Users:";
GroupsTabTitle = "Groups:";
RolesTabTitle = "Roles:";

// default roles
DeviceAdministrator = "Device Administrator";
DeviceGuest = "Device Guest";
DeviceUser = "Device User";

//account types
User = "User";
Group = "Group";

// context menu operatons
DeleteUserGroupContextMenu = "Delete User(s) or Group(s)";
DeleteRoleContextMenu = "Delete Role(s)";
MoveToGroupContextMenu = "Move to Groups";
MoveToUserContextMenu = "Move to Users";

// properties names
NameAttribute = "Name:";
RoleAttribute = "Role:";
AuthenticationAttribute = "Sign In Method:";
AccountTypeAttribute = "Type:";

// progress titles
UpdateInformationProcessTitle = "Updating information...";

// new accounts window
OkButton = "OK";
CancelButton = "Cancel";

AccountSettingsTabTitle = "Account Settings";
PermissionsPoliciesTabTitle = "Permissions Policies";
WindowsDefaultRoleTitle = "Default permission set for Windows:";
LDAPDefaultRoleTitle = "Default permission set for LDAP:";

// alerts
DuplicateNameMessage = "This name has already been used.";
DuplicateUserGroupNameDescription = "This Network User or Group Name has already been used. Please enter a new Network User or Group Name.";
DuplicateNameDescription = "This name has already been used. Please enter a new name.";
NetworkUserAndGroupTitle = "Network User or Group";

DeleteRoleErrorDescription = "The Permission Set (%@) cannot be deleted because it is still being used as a default Permission Set, or in a Network Group or User to Device Permission Set mapping.";

// tooltips
CreateNewUserToolTip = "Create a new user";
CreateNewGroupToolTip = "Create a new group";
CreateNewRoleToolTip = "Create a new role";

DeleteUsersToolTip = "Delete the selected users";
DeleteGroupsToolTip = "Delete the selected groups";
DeleteRolesToolTip = "Delete the selected roles";

// permission policies
ApplicationNameKey = "Application name";
ValueKey = "Value";

ADMINISTRATIONAPPLICATION = "Administration application";
REPORTS = "Reports";
CONFIGURATIONSTATUSPAGES = "Configuration/Status Pages";
CONFIGURATIONPAGE = "Configuration Page";
USAGEPAGE = "Usage Page";
FILEDIRECTORY = "File Directory";
SUPPLIESSTATUSPAGE = "Supplies Status Page";
COLORUSAGEJOBLOG = "Color Usage Job Log";
FAXREPORTS = "Fax Reports";
FAXACTIVITYLOG = "Fax Activity Log";
BILLINGCODESREPORT = "Billing Codes Report";
BLOCKEDFAXLIST = "Blocked Fax List";
LASTFAXCALLREPORT = "Last Fax Call Report";
SPEEDDIALLIST = "Speed Dial List";
OTHERPAGES = "Other Pages";
GENERALSETTINGS = "General Settings";
GENERAL = "General Settings";
DATETIME = "Date/Time";
DATEANDTIME = "Date/Time";
ENERGYSETTINGS = "Energy Settings";
PRINTQUALITYMENU = "Print Quality menu";
MANAGESTOREDJOBS = "Manage Stored Jobs";
ENABLERETRIEVEFROMUSB = "Enable Retrieve from USB";
RESTOREFACTORYSETTINGS = "Restore Factory Settings";
DISPLAYSETTINGS = "Display Settings";
NETWORKSETTINGS = "Network Settings";
NETWORKPROTOCOLS = "Network Protocols";
COPYSETTINGS = "Copy Settings";
FAXSETTINGS = "Fax Settings";
FAXSENDSETTINGS = "Fax Send Settings";
FAXSENDSETUP = "Fax Send Setup";
FAXSETUPWIZARD = "Fax Setup Wizard";
GENERALFAXSENDSETTINGS = "General Fax Send Settings";
DEFAULTJOBOPTIONSFAXSEND = "Default Job Options (Fax Send)";
FAXRECEIVESETTINGS = "Fax Receive Settings";
FAXRECEIVESETUP = "Fax Receive Setup";
FAXPRINTINGSCHEDULE = "Fax Printing Schedule";
BLOCKEDFAXNUMBERS = "Blocked Fax Numbers";
DEFAULTJOBOPTIONSFAXRECEIVE = "Default Job Options (Fax Receive)";
FAXFORWARDING = "Fax Forwarding";
GENERALPRINTSETTINGS = "General Print Settings";
DEFAULTPRINTOPTIONS = "Default Print Options";
MANAGETRAYS = "Manage Trays";
STAPLERSTACKERSETTINGS = "Stapler Stacker Settings";
SCANDIGITALSENDSETTINGS = "Scan/Digital Send Settings";
SCANDIGITALSEND = "Scan/Digital Send Settings";
EMAILSETTINGS = "E-mail Settings";
EMAILSETUP = "E-mail Setup";
DEFAULTJOBSETTINGSEMAILSETTINGS = "Default Job Settings (Email Settings)";
SAVETONETWORKFOLDERSETTINGS = "Save to Network Folder Settings";
SAVETONETWORKFOLDERSETUP = "Save to Network Folder Setup";
DEFAULTJOBSETTINGSNETWORKFOLDER = "Default Job Settings (Network Folder)";
SAVETOUSBSETTINGS = "Save to USB Settings";
SAVETOUSBSETUP = "Save to USB Setup";
SAVETOUSBJOBSETTINGS = "Save to USB Job Settings";
DIGITALSENDSERVICESETUP = "Digital Send Service Setup";
MANAGESUPPLIES = "Manage Supplies";
RESETSUPPLIES = "Reset Supplies";
TROUBLESHOOTINGMENU = "Troubleshooting menu";
TROUBLESHOOTING = "Troubleshooting menu";
RETRIEVEDIAGNOSTICDATA = "Retrieve Diagnostic Data";
DIAGNOSTICDATA = "Retrieve Diagnostic Data";
STAPLERSTACKER = "Stapler Stacker";
RETRIEVEFAXDIAGNOSTICDATA = "Retrieve Fax Diagnostic Data";
REMOTECONTROLPANEL = "Remote Control-Panel";
DIGITALSENDINGSOFTWAREDSSSETUP = "Digital Sending Software (DSS) Setup";
DIGITALSENDINGSOFTWARESETUP = "Digital Sending Software Setup";
SUPPLYSTATUSAPPLICATION = "Supply Status application";
COPYAPPLICATION = "Copy application";
SIDEDCOPYOUTPUT = "1-sided copy output";
MAKEACOLORCOPY = "Make a Color Copy";
SAVETODEVICEMEMORYAPPLICATION = "Save to Device Memory application";
OPENFROMDEVICEMEMORYAPPLICATION = "Open from Device Memory application";
STOREDFAXES = "Stored Faxes";
DELETEANYSTOREDJOBSHAREDORPRIVATE = "Delete any stored job (shared or private)";
TRAYS = "Trays";
ABILITYTOMODIFYTRAYSIZEANDTYPESETTINGS = "Ability to modify tray size and type settings";
PRINTING = "Printing";
PRINTINCOLOR = "Print in color";
OPENFROMUSBAPPLICATION = "Open from USB application";
FAXAPPLICATION = "Fax application";
ABILITYTOEDITTHEBILLINGCODE = "Ability to edit the billing code";
ABILITYTOEDITASPEEDDIAL = "Ability to edit a Speed Dial";
EMAILAPPLICATION = "E-mail application";
ABILITYTOEDITTHEFROMFIELDFOREMAIL = "Ability to edit the From field for e-mail";
ABILITYTOEDITTHETOFIELDFOREMAIL = "Ability to edit the To field for e-mail";
ABILITYTOEDITTHECCFIELDFOREMAIL = "Ability to edit the CC field for e-mail";
ABILITYTOEDITTHEBCCFIELDFOREMAIL = "Ability to edit the BCC field for e-mail";
ABILITYTOEDITTHESUBJECTFIELDFOREMAIL = "Ability to edit the Subject field for e-mail";
ABILITYTOEDITTHEBODYOFANEMAIL = "Ability to edit the body of an e-mail";
ADDRESSBOOK = "Address Book";
ABILITYTOMANAGECONTACTSINAPRIVATEADDRESSBOOK = "Ability to manage contacts in a private address book";
ABILITYTOMANAGECONTACTSINSHAREDADDRESSBOOKS = "Ability to manage contacts in shared address books";
SAVETOSHAREPOINT = "Save to SharePoint®";
NETWORKFOLDERAPPLICATION = "Network Folder application";
ABILITYTOEDITTHENETWORKFOLDERPATH = "Ability to edit the network folder path";
JOBSTATUSAPPLICATION = "Job Status application";
DETAILSORCANCELANYUSERSJOB = "Details or Cancel any user's job";
ABILITYTOPROMOTEANYUSERSJOB = "Ability to Promote any user's job";
ABILITYTOVIEWALLJOBSINTHEJOBLOGFORALLUSERS = "Ability to view all jobs in the Job Log for all users";
SAVETOUSBAPPLICATION = "Save to USB application";
DEVICEMAINTENANCEAPPLICATION = "Device Maintenance application";
INFORMATION = "Information";
DEVICESTATUS = "Device Status";
PRINT = "Print";
HPWEBSERVICES = "HP Web Services";
ONLINEHELP = "Online Help";
FAX = "Fax";
RESTRICTCOLOR = "Restrict Color";

EnableFromRestrictColorPlugin = "To enable this feature go to Restrict Color plugin";
ENABLEDEVICEUSB = "Enable device USB";

DELETEPROTECTEDJOBSWITHOUTENTERINGTHEPASSWORDORPIN = "Delete protected jobs without entering the password or PIN";
JOBLOG = "Job Log";
STATUSINFORMATION = "Status Information";
PRINTABLEREPORTSANDPAGES = "Printable Reports and Pages";
NETWORKING = "Networking";
ALERTS = "Alerts";
CONTROLPANELADMINISTRATIONMENU = "Control Panel Administration Menu";
AUTOSEND = "AutoSend";
DISPLAYCUSTOMIZATIONS = "Display Customizations";
BACKUPANDRESTORE = "Back up and Restore";
SOLUTIONINSTALLER = "Solution Installer";
FIRMWAREUPGRADE = "Firmware Upgrade";
QUOTAANDSTATISTICSSERVICES = "Quota and Statistics Services";
CONTROLPANELCUSTOMIZATION = "Control Panel Customization";
QUICKSETSSETUP = "Quick Sets Setup";
GENERALTROUBLESHOOTING = "General Troubleshooting";
CALIBRATIONCLEANING = "Calibration/Cleaning";
SECURITY = "Security";
GENERALSECURITY = "General Security";
ACCESSCONTROL = "Access Control";
PROTECTSTOREDDATA = "Protect Stored Data";
CERTIFICATEMANAGEMENT = "Certificate Management";
WEBSERVICESECURITY = "Web Service Security";
EMAILDOMAINRESTRICTION = "Email Domain Restriction";
FAXARCHIVEANDFORWARDING = "Fax Archive and Forwarding";
SPEEDDIALS = "Speed Dials";
COPYPRINT = "Copy/Print";
ADJUSTPAPERTYPES = "Adjust Paper Types";
RETRIEVEFROMUSBSETUP = "Retrieve from USB Setup";
REMOTESCANREQUEST = "Remote Scan Request";
EMAILANDSAVETONETWORKFOLDERQUICKSETUPWIZARDS = "Email and Save to Network Folder Quick Setup Wizards";
PREFERENCES = "Preferences";
